In [1]:
import pandas as pd

In [18]:
data_csv_path = 'https://raw.githubusercontent.com/geekcourses/JupyterNotebooksExamples/master/datasets/various/drinks.csv'
df = pd.read_csv(data_csv_path)
df.head(5)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

In [28]:
df.loc[2:4,'country'] = 'Albania'
df.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Albania,25,0,14,0.7,AF
3,Albania,245,138,312,12.4,EU
4,Albania,217,57,45,5.9,AF

In [29]:
# value_counts exampl
df['continent'].value_counts()

continent
AF    53
EU    45
AS    44
OC    16
SA    12
Name: count, dtype: int64

In [30]:
df.value_counts(subset=['continent','country'])

continent  country
AF         Albania      2
EU         Albania      2
           Iceland      1
           Estonia      1
           Finland      1
                       ..
AS         Cambodia     1
           China        1
           India        1
           Indonesia    1
SA         Venezuela    1
Name: count, Length: 168, dtype: int64

In [36]:
# Покажете колко е броя на държавите в континент 'EU'
df.loc[:: ,'continent'].value_counts()

continent
AF    53
EU    45
AS    44
OC    16
SA    12
Name: count, dtype: int64

In [41]:
df.loc[df['continent']=='EU','country'].value_counts().shape[0]

44

In [43]:
# Покажете количествата бира ('beer_servings'), вино ('wine_servings'), които се конcумират в Afghanistan
df.loc[ df['country']=='Afghanistan', ['beer_servings', 'wine_servings']]

   beer_servings  wine_servings
0              0              0

In [47]:
# Покажете какво е максимално количество консумирано вино ('wine_servings') в целия дейтасет и коя е държавата в която се консумира то.

max_wine_serving = df['wine_servings'].max()

df.loc[ df['wine_servings']==max_wine_serving, 'country']

61    France
Name: country, dtype: object

In [60]:
# Покажете какво е максимално количество консумирано вино ('wine_servings') във всекие един континент и коя е държавата в която се консумира то.

# WORKING, BUT NOT EFFECTIVE ( use groupby() )!!!
continents = df['continent'].value_counts()

for continent in continents.index:
    # print(continent)
    continent_df = df[ df['continent']==continent ]
    continent_df_max_wine = continent_df['wine_servings'].max()
    country = continent_df.loc[ df['wine_servings']==continent_df_max_wine, 'country']
    print(country.values[0])

Equatorial Guinea
France
Laos
Australia
Argentina

In [64]:
df.loc[ df['wine_servings']==370, 'country'].values[0]

'France'

In [75]:
for continent in df['continent'].value_counts().index:
    print(continent)

AF
EU
AS
OC
SA

In [73]:
for continent in df['continent'].unique():
    print(continent)

AS
EU
AF
nan
SA
OC

In [84]:

# df.loc[rows, columns]
# df.iloc[rows, columns]

# df[column_label]



# df.loc[:,'wine_servings]
# df['wine_servings']

# result=df.loc[ df['wine_servings']==  ]

# print(f'{result.iloc[0]["wine_servings"]} is the maximum wine servings in {result.iloc[0]['country']}.')

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Albania,25,0,14,0.7,AF
3,Albania,245,138,312,12.4,EU
4,Albania,217,57,45,5.9,AF
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

In [93]:
# df = pd.DataFrame(
#     {
#         1: [1,2,3],
#         2: [4,5,6],
#         3: [7,8,9],
#     }
# )
# df

   1  2  3
0  1  4  7
1  2  5  8
2  3  6  9

In [98]:
# df.loc[rows, columns]
# df.iloc[rows, columns]

# df[column_label]


# df.iloc[:,-1]

0    7
1    8
2    9
Name: 3, dtype: int64